# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
del baby_names['Unnamed: 0']
del baby_names['Id']

In [6]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [9]:
# non unique counts
baby_names.groupby('Gender')['Name'].count()

Gender
F    558846
M    457549
Name: Name, dtype: int64

In [10]:
# unique name counts
baby_names.groupby('Gender')["Name"].nunique()

Gender
F    10929
M     8012
Name: Name, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [37]:
names = baby_names.groupby('Name').sum()

In [39]:
names.sort_values('Count', ascending=False).head()

             Year   Count
Name
Jacob     1141099  242874
Emma      1137085  214852
Michael   1161152  214405
Ethan     1139091  209277
Isabella  1137090  204798

### Step 8. How many different names exist in the dataset?

In [40]:
print(len(names))
print(baby_names.Name.nunique())

17632
17632

### Step 9. What is the name with most occurrences?

In [45]:
names.sort_values('Count', ascending=False).head(1)

          Year   Count
Name
Jacob  1141099  242874

### Step 10. How many different names have the least occurrences?

In [46]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [49]:
names[names.Count == names.Count.median()].head()

          Year  Count
Name
Aishani  14078     49
Alara    16079     49
Alysse   16057     49
Ameir    16086     49
Anely    16071     49

### Step 12. What is the standard deviation of names?

In [50]:
names.Count.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [52]:
names[['Count']].describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000